Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  /* TPU Encoder clock inputs (rear wheels) */
  k_pin_enc2_pha = k_rx_pc_2, /**< PC.2 - TCLKA (encoder 2 phase A) */
  k_pin_enc2_phb = k_rx_pa_3, /**< PA.3 - TCLKB (encoder 2 phase B) */
  k_pin_enc3_pha = k_rx_pc_0, /**< PC.0 - TCLKC (encoder 3 phase A) */
  k_pin_enc3_phb = k_rx_pb_3, /**< PB.3 - TCLKD (encoder 3 phase B) */

  /* GPTW PWM outputs (4 motors x 2 pins = IN2 + IN1, distributed across ports) */
  k_pin_motor0_in2 = k_rx_p2_3, /**< P2.3 - GTIOC0A (motor 0 IN2/direction, pin 34) */
  k_pin_motor0_in1 = k_rx_p1_7, /**< P1.7 - GTIOC0B (motor 0 IN1/PWM, pin 38) */
  k_pin_motor1_in2 = k_rx_p2_2, /**< P2.2 - GTIOC1A (motor 1 IN2/direction, pin 35) */
  k_pin_motor1_in1 = k_rx_pc_3, /**< PC.3 - GTIOC1B (motor 1 IN1/PWM, pin 67) */
  k_pin_motor2_in2 = k_rx_pe_3, /**< PE.3 - GTIOC2A (motor 2 IN2/direction, pin 108) */
  k_pin_motor2_in1 = k_rx_p8_6, /**< P8.6 - GTIOC2B (motor 2 IN1/PWM, pin 41) */
  k_pin_motor3_in2 = k_rx_pe_7, /**< PE.7 - GTIOC3A (motor 3 IN2/direction, pin 101) */
  k_pin_motor3_in1 = k_rx_pc_6, /**< PC.6 - GTIOC3B (motor 3 IN1/PWM, pin 61) */

  /* IMU (RIIC1 I2C + GPIO) */
  k_pin_imu_scl = k_rx_p2_1, /**< P2.1 - SCL1 (IMU I2C clock, pin 36) */
  k_pin_imu_sda = k_rx_p2_0, /**< P2.0 - SDA1 (IMU I2C data, pin 37) */
  k_pin_imu_int = k_rx_p3_2, /**< P3.2 - IMU interrupt (active-low, pin 27) */
  k_pin_imu_rst = k_rx_p8_3, /**< P8.3 - IMU reset (active-low, pin 58) */

  /* DRV8263H DRVOFF pins (GPIO output, initial HIGH = outputs disabled) */
  k_pin_motor0_drvoff = k_rx_p6_1, /**< P6.1 - Motor 0 DRVOFF (pin 115) */
  k_pin_motor1_drvoff = k_rx_p6_3, /**< P6.3 - Motor 1 DRVOFF (pin 113) */
  k_pin_motor2_drvoff = k_rx_pe_0, /**< PE.0 - Motor 2 DRVOFF (pin 111) */
  k_pin_motor3_drvoff = k_rx_pe_2, /**< PE.2 - Motor 3 DRVOFF (pin 109) */

  /* DRV8263H nSLEEP pins (GPIO output, initial HIGH = awake) */
  k_pin_motor0_nsleep = k_rx_p6_0, /**< P6.0 - Motor 0 nSLEEP (pin 117) */
  k_pin_motor1_nsleep = k_rx_p6_2, /**< P6.2 - Motor 1 nSLEEP (pin 114) */
  k_pin_motor2_nsleep = k_rx_p6_4, /**< P6.4 - Motor 2 nSLEEP (pin 112) */
  k_pin_motor3_nsleep = k_rx_pe_1, /**< PE.1 - Motor 3 nSLEEP (pin 110) */

  /* ADC current sense (S12AD0, AN004-AN007) */
  k_pin_adc_an004 = k_rx_p4_4, /**< P4.4 - AN004 (motor 3 current) */
  k_pin_adc_an005 = k_rx_p4_5, /**< P4.5 - AN005 (motor 2 current) */
  k_pin_adc_an006 = k_rx_p4_6, /**< P4.6 - AN006 (motor 1 current) */
  k_pin_adc_an007 = k_rx_p4_7, /**< P4.7 - AN007 (motor 0 current) */
} rx_mpc_pin_t;

/**
 * @enum gpio_pin_counts_t
 * @brief Static array-size and loop-bound constants for GPIO pin groups
 *
 * @details
 * Provides compile-time upper bounds for all GPIO pin arrays. Used as loop
 * limits in internal_gpio_init_*() helpers and as array-size declarators.
 *
 * @invariant All values must fit in uint8_t (loop counter type)
 *
 * @code{.c}
 * const rx_port_pin_t pins[k_gptw_pin_count] = { ... };
 * for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
 *     rx_mpc_set_gptw(pins[i]);
 * }
 * @endcode
 *
 * @see internal_gpio_init_gptw_pwm() Uses k_gptw_pin_count
 * @see internal_gpio_init_motor_driver_ctrl() Uses k_motor_count
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_gptw_pin_count = 8, /**< 4 motors x 2 pins (IN2 + IN1) */
  k_motor_count    = 4, /**< 4 DRV8263H motor drivers */
  k_sonar_count    = 4, /**< 4 HC-SR04 ultrasonic sensors */
} gpio_pin_counts_t;

/** @brief GPTW PWM frequency constant */
typedef enum : uint32_t {
  k_gptw_pwm_freq_hz = 20000, /**< 20 kHz PWM frequency */
} gptw_freq_t;

/** @brief GPTW dead-time constant */
typedef enum : uint16_t {
  k_gptw_deadtime_ns = 1000, /**< 1 us dead-time between complementary outputs */
} gptw_deadtime_t;

/* RSPI channel: use k_rspi_channel_2 from hardware.h for host SPI peripheral */

/** @brief I2C channel assignments */
typedef enum : uint8_t {
  k_i2c_channel_0 = 0, /**< RIIC0 = host I2C (RPi5 comms) */
  k_i2c_channel_1 = 1, /**< RIIC1 = IMU I2C (BNO055 + BMP280) */
} i2c_channel_t;

/** @brief I2C bus frequency constants */
typedef enum : uint32_t {
  k_i2c_host_freq_hz = 400000, /**< 400 kHz fast mode for host (RIIC0) */
  k_i2c_imu_freq_hz  = 400000, /**< 400 kHz fast mode for IMU sensors (RIIC1) */
} i2c_freq_t;

/** @brief Number of motor current ADC channels */
typedef enum : uint8_t {
  k_motor_adc_count = 4, /**< 4 motors = 4 current sense channels */
} adc_count_t;

/**
 * @enum gpio_reg_constants_t
 * @brief Constants for GPIO register bit manipulation
 *
 * @details
 * Provides named constants for single-bit operations on 8-bit GPIO port
 * registers (PMR, PDR, PODR). Eliminates magic number `1U` in bit-shift
 * expressions and documents the hardware-imposed pin count limit.
 *
 * @invariant k_gpio_single_bit_mask == 1 (exactly one bit for shift operations)
 * @invariant k_gpio_max_pin_number == k_pins_per_port - 1
 *
 * @see internal_gpio_set_output() Uses these for register bit manipulation
 * @see internal_gpio_set_input() Uses these for register bit manipulation
 * @see k_pins_per_port From rx_gpio_constants.h (hardware 8-pin limit)
 *
 * @code{.c}
 * // Set pin 5 as output in PDR register (read-modify-write)
 * port->PDR |= (uint8_t)(k_gpio_single_bit_mask << k_bit_led);
 *
 * // Validate pin number before access
 * if (pin_number <= k_gpio_max_pin_number) {
 *     port->PODR |= (uint8_t)(k_gpio_single_bit_mask << pin_number);
 * }
 * @endcode
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_gpio_single_bit_mask = 1U, /**< Single-bit mask shifted by pin number for register RMW */
  k_gpio_max_pin_number  = 7U, /**< Maximum valid pin index (0-7, 8 pins per port) */
} gpio_reg_constants_t;

/** @brief SCKCR3 reset/unconfigured state value (before clock initialization) */
static const uint8_t s_sckcr3_reset_state = 0U;

/**
 * @brief Configure I2C bus pins (RIIC0/RIIC1)
 *
 * @details
 * Configures MPC pin multiplexing for Host I2C (RIIC0) on P1.2/P1.3 and
 * RIIC host I2C on P2.0/P2.1. Sets PSEL registers to enable I2C peripheral
 * function for SCL and SDA pins.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.2 configured as SCL0, P1.3 configured as SDA0
 * @post P2.1 configured as SCL1, P2.0 configured as SDA1
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_i2c(void)
{
  static const char* s_tag = "GPIO_I2C";

  /* Host I2C (RIIC0): SCL0 + SDA0 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_scl0);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL0 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_sda0);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA0 pin config failed");

