Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  /* IMU I2C (RIIC1): SCL1 + SDA1 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_scl);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL1 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_sda);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA1 pin config failed");

  /* IMU INT: GPIO input (active-low interrupt from IMU) */
  err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_imu_int);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU INT MPC config failed");

  internal_gpio_set_input((rx_port_pin_t)k_pin_imu_int);

  /* IMU RST: GPIO output, initial HIGH (not in reset) */
  err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_imu_rst);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU RST MPC config failed");

  internal_gpio_set_output((rx_port_pin_t)k_pin_imu_rst, true); /* HIGH = not in reset */

  return k_rx_ok;
}

/**
 * @brief Configure DRV8263H motor driver control pins (DRVOFF + nSLEEP)
 *
 * @details
 * Configures 8 GPIO output pins for DRV8263H motor driver control:
 * - 4x DRVOFF pins: Output HIGH (driver outputs disabled for safe startup)
 * - 4x nSLEEP pins: Output HIGH (driver awake, not in sleep mode)
 *
 * ## Safe Initialization Order (Critical)
 *
 * DRVOFF pins are configured **before** nSLEEP pins. This ordering is
 * required by the DRV8263H power-up sequence:
 *
 * 1. DRVOFF = HIGH first  -> H-bridge outputs disabled (safe state)
 * 2. nSLEEP = HIGH second -> driver wakes up with outputs already disabled
 *
 * If nSLEEP were asserted first (waking the driver), the H-bridge outputs
 * could briefly be in an undefined state before DRVOFF is driven HIGH,
 * risking uncontrolled motor movement or shoot-through.
 *
 * Motor outputs remain disabled (DRVOFF=HIGH) until the motor control task
 * explicitly drives DRVOFF LOW before commanding PWM.
 * @todo (#367) Motor control task must drive DRVOFF LOW before commanding PWM.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 8 pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post All 4 DRVOFF pins configured as GPIO outputs, driven HIGH (disabled)
 * @post All 4 nSLEEP pins configured as GPIO outputs, driven HIGH (awake)
 *
 * @note Not thread-safe. Performs non-atomic RMW on port registers.
 * @note Called only during single-threaded initialization before RTOS start.
 *
 * @warning DRVOFF must be driven HIGH before nSLEEP is asserted to prevent
 *          uncontrolled H-bridge output during driver wake-up.
 *
 * @see internal_gpio_set_output() Used for all DRVOFF and nSLEEP pins
 * @see rx_mpc_set_gpio() MPC configuration for GPIO mode
 * @see internal_gpio_init_gptw_pwm() Configures PWM pins for DRV8263H IN1/IN2
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_motor_driver_ctrl(void)
{
  static const char* s_tag = "GPIO_DRV_CTRL";

  /* NASA Rule 5: precondition validation */
  RX_ASSERT(rx_port_get_base(rx_port_from_pin((rx_port_pin_t)k_pin_motor0_drvoff)) != nullptr,
            "Motor 0 DRVOFF port base invalid");
  RX_ASSERT(rx_port_get_base(rx_port_from_pin((rx_port_pin_t)k_pin_motor0_nsleep)) != nullptr,
            "Motor 0 nSLEEP port base invalid");

  const rx_port_pin_t drvoff_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_drvoff,
                                                    (rx_port_pin_t)k_pin_motor1_drvoff,
                                                    (rx_port_pin_t)k_pin_motor2_drvoff,
                                                    (rx_port_pin_t)k_pin_motor3_drvoff};

  const rx_port_pin_t nsleep_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_nsleep,
                                                    (rx_port_pin_t)k_pin_motor1_nsleep,
                                                    (rx_port_pin_t)k_pin_motor2_nsleep,
                                                    (rx_port_pin_t)k_pin_motor3_nsleep};

  /*
   * CRITICAL ORDERING: DRVOFF must be configured HIGH (outputs disabled) BEFORE
   * nSLEEP wakes the driver. This prevents the DRV8263H H-bridge from entering
   * an undefined output state during the wake-up transition. See DRV8263H
   * datasheet Section 7.3.1 (Device Functional Modes) for power-up sequencing.
   */

  /* Step 1: Configure DRVOFF pins HIGH first -- ensures H-bridge outputs are
   * disabled before the driver is awakened by nSLEEP. */
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(drvoff_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "DRVOFF MPC config failed");
    internal_gpio_set_output(drvoff_pins[i], true); /* HIGH = outputs disabled */
  }

  /* Step 2: Configure nSLEEP pins HIGH second -- driver wakes with DRVOFF
   * already asserted, so H-bridge outputs remain safely disabled. */
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(nsleep_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "nSLEEP MPC config failed");
    internal_gpio_set_output(nsleep_pins[i], true); /* HIGH = awake */
  }

  /* Step 3: Wait for DRV8263H-Q1 tWAKE (nFAULT returns HIGH after ~1.2 ms).
   * Uses busy-wait because this runs pre-kernel (before tx_kernel_enter()),
   * so ThreadX APIs like tx_thread_sleep() are not available.
   * The volatile decrement loop takes ~5-6 CPU cycles per iteration,
   * yielding an actual delay of approximately 10 ms (well above the
   * 1.2 ms tWAKE spec, providing ample safety margin).
   * Cannot poll nFAULT GPIO here because nFAULT is configured as POEG input
   * (GTETRG), not general-purpose GPIO. */
  internal_busy_wait_us(k_twake_busy_wait_us, k_twake_cpu_mhz);

  return k_rx_ok;
}

/**
 * @brief Configure ADC current sense input pins
 *
 * @details
 * Configures MPC pin multiplexing for S12AD0 analog inputs AN004-AN007 on
 * P4.4-P4.7. Disables digital input buffers and sets pins to analog mode for
 * motor current sensing.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P4.4-P4.7 configured as AN004-AN007 analog inputs
 * @post ADC pins ready for current sensing
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_adc(void)
{
  static const char* s_tag = "GPIO_ADC";

  rx_err_t err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004);
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005);
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006);
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

